In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [2]:
data= pd.read_csv('C:/Users/User/Desktop/Dr Ammar/decision tree/mall customer.csv')

In [3]:
data.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [4]:
data['Genre'] = data['Genre'].replace('Male' , 1)
data['Genre'] = data['Genre'].replace('Female' , 0)

In [5]:
data.head()

   CustomerID  Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1      1   19                  15                      39
1           2      1   21                  15                      81
2           3      0   20                  16                       6
3           4      0   23                  16                      77
4           5      0   31                  17                      40

In [6]:
data.tail()

     CustomerID  Genre  Age  Annual Income (k$)  Spending Score (1-100)
195         196      0   35                 120                      79
196         197      0   45                 126                      28
197         198      1   32                 126                      74
198         199      1   32                 137                      18
199         200      1   30                 137                      83

# Selecion of input and output variable

In [7]:
data.columns

Index(['CustomerID', 'Genre', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [8]:
x=data[['Genre', 'Age','Annual Income (k$)', ]]
y=data[['Spending Score (1-100)']]

In [9]:
x.head()

   Genre  Age  Annual Income (k$)
0      1   19                  15
1      1   21                  15
2      0   20                  16
3      0   23                  16
4      0   31                  17

In [10]:
y.head()

   Spending Score (1-100)
0                      39
1                      81
2                       6
3                      77
4                      40

# Machine learning

In [11]:
from sklearn.tree import DecisionTreeClassifier 

# create and fit our model

model  = DecisionTreeClassifier().fit(x,y)

In [12]:
model.predict([[1,27, 19]])

array([79], dtype=int64)

# model accuracy

### split data test

In [13]:
from sklearn.model_selection import train_test_split
x_train,x_test , y_train , y_test  =train_test_split(x,y ,test_size=0.10,random_state=0)

In [14]:
# model creation
model=DecisionTreeClassifier().fit(x_train,y_train)

model.predict(x_test)

array([ 4, 91, 56, 49, 75, 28, 77,  5, 14,  7, 46, 71, 85, 35, 46, 77, 75,
       11, 61, 41], dtype=int64)

In [15]:
from sklearn.metrics import accuracy_score

In [16]:
# score = accuracy_score(actual_value , predict_value)
score = accuracy_score(y_test,model.predict(x_test))

In [17]:
score

0.0

# how to train and safe your model

In [18]:
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
import joblib

In [19]:
model = DecisionTreeClassifier().fit(x,y)
joblib.dump(model, 'salary.joblib')

['salary.joblib']

# graph

In [20]:
model =DecisionTreeClassifier().fit(x,y)

In [21]:
from sklearn import tree

# graph
tree.export_graphviz(model,
                    out_file='salary.dot',
                    feature_names=['Genre','Age', 'Annual Income (k$)'] ,
                     label='all' ,
                    rounded=True ,
                    filled=True)